[Killed] BlockStatement
src/pages/Login.jsx:13:9
     e.preventDefault();
     setError("");
 
-    try {
-      const res = await fetch("http://localhost:8080/api/users/login", {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ username, password })
-      });
-
-      const data = await res.json();
-
-      if (!res.ok) {
-        setError(data.error || "Error al iniciar sesión");
-        return;
-      }
-
-      // Guardar usuario en localStorage
-      localStorage.setItem("currentUser", JSON.stringify(data.user));
-
-      // Entrar a la aplicación
-      onLogin(data.user);
-
-    } catch (err) {
+    try {} catch (err) {
       console.error(err);
       setError("No se pudo conectar con el servidor");
killedBy: Login.jsx - manejo de errores muestra mensaje de error cuando las credenciales son incorrectas
statusReason: Error: Unable to find an element with the text: Credenciales incorrectas. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Timeout] StringLiteral
src/pages/Login.jsx:15:17
 
     try {
       const res = await fetch("http://localhost:8080/api/users/login", {
-        method: "POST",
+        method: "",
         headers: { "Content-Type": "application/json" },
         body: JSON.stringify({ username, password })

[Timeout] ObjectLiteral
src/pages/Login.jsx:17:30
       const res = await fetch("http://localhost:8080/api/users/login", {
         method: "POST",
         headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ username, password })
+        body: JSON.stringify({})
       });
 

[Killed] BlockStatement
src/pages/Login.jsx:22:20
 
       const data = await res.json();
 
-      if (!res.ok) {
-        setError(data.error || "Error al iniciar sesión");
-        return;
-      }
+      if (!res.ok) {}
 
       // Guardar usuario en localStorage
killedBy: Login.jsx - manejo de errores muestra mensaje de error cuando las credenciales son incorrectas
statusReason: Error: Unable to find an element with the text: Credenciales incorrectas. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Killed] LogicalOperator
src/pages/Login.jsx:23:18
       const data = await res.json();
 
       if (!res.ok) {
-        setError(data.error || "Error al iniciar sesión");
+        setError(data.error && "Error al iniciar sesión");
         return;
       }
killedBy: Login.jsx - manejo de errores muestra mensaje de error cuando las credenciales son incorrectas
statusReason: Error: Unable to find an element with the text: Credenciales incorrectas. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Timeout] ConditionalExpression
src/pages/Login.jsx:23:18
       const data = await res.json();
 
       if (!res.ok) {
-        setError(data.error || "Error al iniciar sesión");
+        setError(true);
         return;
       }

[Timeout] BlockStatement
src/pages/Login.jsx:33:19
       // Entrar a la aplicación
       onLogin(data.user);
 
-    } catch (err) {
-      console.error(err);
-      setError("No se pudo conectar con el servidor");
-    }
+    } catch (err) {}
   }
 

[Timeout] ArrowFunction
src/pages/Login.jsx:47:21
         <label>Nombre de usuario</label>
         <input
           value={username}
-          onChange={e => setUsername(e.target.value)}
+          onChange={() => undefined}
           placeholder="Tu usuario..."
           required

[Timeout] ArrowFunction
src/pages/Login.jsx:56:21
         <input
           type="password"
           value={password}
-          onChange={e => setPassword(e.target.value)}
+          onChange={() => undefined}
           placeholder="••••••"
           required

[Timeout] LogicalOperator
src/pages/Login.jsx:61:10
           required
         />
 
-        {error && <p className="error">{error}</p>}
+        {error || <p className="error">{error}</p>}
 
         <button type="submit">Entrar</button>
