[Survived] BlockStatement
src/App.jsx:19:28
 import Register from "./pages/Register";
 
 // Fisher-Yates shuffle
-function shuffleArray(arr) {
-  const a = [...arr];
-  for (let i = a.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [a[i], a[j]] = [a[j], a[i]];
-  }
-  return a;
-}
+function shuffleArray(arr) {}
 
 export default function App() {

[Survived] ArithmeticOperator
src/App.jsx:21:16
 // Fisher-Yates shuffle
 function shuffleArray(arr) {
   const a = [...arr];
-  for (let i = a.length - 1; i > 0; i--) {
+  for (let i = a.length + 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [a[i], a[j]] = [a[j], a[i]];

[Survived] ConditionalExpression
src/App.jsx:21:30
 // Fisher-Yates shuffle
 function shuffleArray(arr) {
   const a = [...arr];
-  for (let i = a.length - 1; i > 0; i--) {
+  for (let i = a.length - 1; false; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [a[i], a[j]] = [a[j], a[i]];

[Survived] ArithmeticOperator
src/App.jsx:22:26
 function shuffleArray(arr) {
   const a = [...arr];
   for (let i = a.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() / (i + 1));
     [a[i], a[j]] = [a[j], a[i]];
   }

[Survived] ArithmeticOperator
src/App.jsx:22:43
 function shuffleArray(arr) {
   const a = [...arr];
   for (let i = a.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() * (i - 1));
     [a[i], a[j]] = [a[j], a[i]];
   }

[Survived] ArrayDeclaration
src/App.jsx:23:20
   const a = [...arr];
   for (let i = a.length - 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
-    [a[i], a[j]] = [a[j], a[i]];
+    [a[i], a[j]] = [];
   }
   return a;

[Survived] BlockStatement
src/App.jsx:32:19
   const [user, setUser] = useState(null);
   const [authScreen, setAuthScreen] = useState("login");
 
-  useEffect(() => {
-    try {
-      const stored = localStorage.getItem("currentUser");
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (parsed) {
-          setUser(parsed);
-          setAuthScreen("app");
-        }
-      }
-    } catch (e) { }
-  }, []);
+  useEffect(() => {}, []);
 
   function handleLogin(userData) {

[Survived] BlockStatement
src/App.jsx:33:9
   const [authScreen, setAuthScreen] = useState("login");
 
   useEffect(() => {
-    try {
-      const stored = localStorage.getItem("currentUser");
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (parsed) {
-          setUser(parsed);
-          setAuthScreen("app");
-        }
-      }
-    } catch (e) { }
+    try {} catch (e) { }
   }, []);
 

[Survived] BlockStatement
src/App.jsx:35:19
   useEffect(() => {
     try {
       const stored = localStorage.getItem("currentUser");
-      if (stored) {
-        const parsed = JSON.parse(stored);
-        if (parsed) {
-          setUser(parsed);
-          setAuthScreen("app");
-        }
-      }
+      if (stored) {}
     } catch (e) { }
   }, []);

[Survived] ConditionalExpression
src/App.jsx:35:11
   useEffect(() => {
     try {
       const stored = localStorage.getItem("currentUser");
-      if (stored) {
+      if (true) {
         const parsed = JSON.parse(stored);
         if (parsed) {

[Survived] ConditionalExpression
src/App.jsx:37:13
       const stored = localStorage.getItem("currentUser");
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (parsed) {
+        if (false) {
           setUser(parsed);
           setAuthScreen("app");

[Survived] ConditionalExpression
src/App.jsx:37:13
       const stored = localStorage.getItem("currentUser");
       if (stored) {
         const parsed = JSON.parse(stored);
-        if (parsed) {
+        if (true) {
           setUser(parsed);
           setAuthScreen("app");

[Survived] BlockStatement
src/App.jsx:45:34
     } catch (e) { }
   }, []);
 
-  function handleLogin(userData) {
-    setUser(userData);
-    localStorage.setItem("currentUser", JSON.stringify(userData));
-    setAuthScreen("app");
-  }
+  function handleLogin(userData) {}
   function handleLogout() {
     setUser(null);

[Survived] StringLiteral
src/App.jsx:48:19
   function handleLogin(userData) {
     setUser(userData);
     localStorage.setItem("currentUser", JSON.stringify(userData));
-    setAuthScreen("app");
+    setAuthScreen("");
   }
   function handleLogout() {

[Survived] BlockStatement
src/App.jsx:50:27
     localStorage.setItem("currentUser", JSON.stringify(userData));
     setAuthScreen("app");
   }
-  function handleLogout() {
-    setUser(null);
-    localStorage.removeItem("currentUser");
-    setAuthScreen("login");
-  }
+  function handleLogout() {}
 
   // GAME STATE

[Survived] BooleanLiteral
src/App.jsx:70:42
   const [choiceCount, setChoiceCount] = useState(0);
   const MAX_CHOICES = 15;
   const [screen, setScreen] = useState("home");
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [votesMap, setVotesMap] = useState({});
 

[Survived] BlockStatement
src/App.jsx:75:19
 
   const BASE_API = "http://localhost:8080/api/games";
 
-  useEffect(() => {
-    let mounted = true;
-    setLoading(true);
-    (async () => {
-      try {
-        const res = await fetch(BASE_API);
-        if (!res.ok) throw new Error("No list endpoint or bad response");
-        const data = await res.json();
-        const list = Array.isArray(data) ? data : data.games ?? [];
-        if (mounted) setGames(list.length ? list : mockGames);
-      } catch (err) {
-        console.warn("Fetch games failed, using mockGames:", err.message);
-        if (mounted) setGames(mockGames);
-      } finally {
-        if (mounted) setLoading(false);
-      }
-    })();
-    return () => { mounted = false; };
-  }, []);
+  useEffect(() => {}, []);
 
   function start() {

[Survived] BooleanLiteral
src/App.jsx:76:19
   const BASE_API = "http://localhost:8080/api/games";
 
   useEffect(() => {
-    let mounted = true;
+    let mounted = false;
     setLoading(true);
     (async () => {

[Survived] BooleanLiteral
src/App.jsx:77:16
 
   useEffect(() => {
     let mounted = true;
-    setLoading(true);
+    setLoading(false);
     (async () => {
       try {

[Survived] BlockStatement
src/App.jsx:78:18
   useEffect(() => {
     let mounted = true;
     setLoading(true);
-    (async () => {
-      try {
-        const res = await fetch(BASE_API);
-        if (!res.ok) throw new Error("No list endpoint or bad response");
-        const data = await res.json();
-        const list = Array.isArray(data) ? data : data.games ?? [];
-        if (mounted) setGames(list.length ? list : mockGames);
-      } catch (err) {
-        console.warn("Fetch games failed, using mockGames:", err.message);
-        if (mounted) setGames(mockGames);
-      } finally {
-        if (mounted) setLoading(false);
-      }
-    })();
+    (async () => {})();
     return () => { mounted = false; };
   }, []);

[Survived] BlockStatement
src/App.jsx:79:11
     let mounted = true;
     setLoading(true);
     (async () => {
-      try {
-        const res = await fetch(BASE_API);
-        if (!res.ok) throw new Error("No list endpoint or bad response");
-        const data = await res.json();
-        const list = Array.isArray(data) ? data : data.games ?? [];
-        if (mounted) setGames(list.length ? list : mockGames);
-      } catch (err) {
+      try {} catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);
         if (mounted) setGames(mockGames);

[Survived] ConditionalExpression
src/App.jsx:81:13
     (async () => {
       try {
         const res = await fetch(BASE_API);
-        if (!res.ok) throw new Error("No list endpoint or bad response");
+        if (false) throw new Error("No list endpoint or bad response");
         const data = await res.json();
         const list = Array.isArray(data) ? data : data.games ?? [];

[Survived] BooleanLiteral
src/App.jsx:81:13
     (async () => {
       try {
         const res = await fetch(BASE_API);
-        if (!res.ok) throw new Error("No list endpoint or bad response");
+        if (res.ok) throw new Error("No list endpoint or bad response");
         const data = await res.json();
         const list = Array.isArray(data) ? data : data.games ?? [];

[Survived] LogicalOperator
src/App.jsx:83:51
         const res = await fetch(BASE_API);
         if (!res.ok) throw new Error("No list endpoint or bad response");
         const data = await res.json();
-        const list = Array.isArray(data) ? data : data.games ?? [];
+        const list = Array.isArray(data) ? data : data.games && [];
         if (mounted) setGames(list.length ? list : mockGames);
       } catch (err) {

[Survived] ConditionalExpression
src/App.jsx:84:13
         if (!res.ok) throw new Error("No list endpoint or bad response");
         const data = await res.json();
         const list = Array.isArray(data) ? data : data.games ?? [];
-        if (mounted) setGames(list.length ? list : mockGames);
+        if (false) setGames(list.length ? list : mockGames);
       } catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);

[Survived] ConditionalExpression
src/App.jsx:84:13
         if (!res.ok) throw new Error("No list endpoint or bad response");
         const data = await res.json();
         const list = Array.isArray(data) ? data : data.games ?? [];
-        if (mounted) setGames(list.length ? list : mockGames);
+        if (true) setGames(list.length ? list : mockGames);
       } catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);

[Survived] BlockStatement
src/App.jsx:85:21
         const data = await res.json();
         const list = Array.isArray(data) ? data : data.games ?? [];
         if (mounted) setGames(list.length ? list : mockGames);
-      } catch (err) {
-        console.warn("Fetch games failed, using mockGames:", err.message);
-        if (mounted) setGames(mockGames);
-      } finally {
+      } catch (err) {} finally {
         if (mounted) setLoading(false);
       }

[Survived] StringLiteral
src/App.jsx:86:22
         const list = Array.isArray(data) ? data : data.games ?? [];
         if (mounted) setGames(list.length ? list : mockGames);
       } catch (err) {
-        console.warn("Fetch games failed, using mockGames:", err.message);
+        console.warn("", err.message);
         if (mounted) setGames(mockGames);
       } finally {

[Survived] ConditionalExpression
src/App.jsx:87:13
         if (mounted) setGames(list.length ? list : mockGames);
       } catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);
-        if (mounted) setGames(mockGames);
+        if (true) setGames(mockGames);
       } finally {
         if (mounted) setLoading(false);

[Survived] ConditionalExpression
src/App.jsx:87:13
         if (mounted) setGames(list.length ? list : mockGames);
       } catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);
-        if (mounted) setGames(mockGames);
+        if (false) setGames(mockGames);
       } finally {
         if (mounted) setLoading(false);

[Survived] BlockStatement
src/App.jsx:88:17
       } catch (err) {
         console.warn("Fetch games failed, using mockGames:", err.message);
         if (mounted) setGames(mockGames);
-      } finally {
-        if (mounted) setLoading(false);
-      }
+      } finally {}
     })();
     return () => { mounted = false; };

[Survived] ConditionalExpression
src/App.jsx:89:13
         console.warn("Fetch games failed, using mockGames:", err.message);
         if (mounted) setGames(mockGames);
       } finally {
-        if (mounted) setLoading(false);
+        if (true) setLoading(false);
       }
     })();

[Survived] ConditionalExpression
src/App.jsx:89:13
         console.warn("Fetch games failed, using mockGames:", err.message);
         if (mounted) setGames(mockGames);
       } finally {
-        if (mounted) setLoading(false);
+        if (false) setLoading(false);
       }
     })();

[Survived] BooleanLiteral
src/App.jsx:92:30
         if (mounted) setLoading(false);
       }
     })();
-    return () => { mounted = false; };
+    return () => { mounted = true; };
   }, []);
 

[Survived] BlockStatement
src/App.jsx:92:18
         if (mounted) setLoading(false);
       }
     })();
-    return () => { mounted = false; };
+    return () => {};
   }, []);
 

[Survived] BlockStatement
src/App.jsx:95:20
     return () => { mounted = false; };
   }, []);
 
-  function start() {
-    const source = games && games.length ? games : mockGames;
-    const shuffled = shuffleArray(source);
-    // no fijamos champion al iniciar
-    setChampion(null);
-    // left/right = las dos primeras cartas
-    setLeft(shuffled[0] ?? null);
-    setRight(shuffled[1] ?? null);
-    setGames(shuffled);
-    setBufferIndex(2);
-    setVotesMap({});
-    setChoiceCount(0);
-    setScreen("game");
-  }
+  function start() {}
 
   async function markPickOnServer(gameId) {

[Survived] ConditionalExpression
src/App.jsx:96:20
   }, []);
 
   function start() {
-    const source = games && games.length ? games : mockGames;
+    const source = false ? games : mockGames;
     const shuffled = shuffleArray(source);
     // no fijamos champion al iniciar

[Survived] LogicalOperator
src/App.jsx:96:20
   }, []);
 
   function start() {
-    const source = games && games.length ? games : mockGames;
+    const source = games || games.length ? games : mockGames;
     const shuffled = shuffleArray(source);
     // no fijamos champion al iniciar

[Survived] LogicalOperator
src/App.jsx:101:13
     // no fijamos champion al iniciar
     setChampion(null);
     // left/right = las dos primeras cartas
-    setLeft(shuffled[0] ?? null);
+    setLeft(shuffled[0] && null);
     setRight(shuffled[1] ?? null);
     setGames(shuffled);

[Survived] LogicalOperator
src/App.jsx:102:14
     setChampion(null);
     // left/right = las dos primeras cartas
     setLeft(shuffled[0] ?? null);
-    setRight(shuffled[1] ?? null);
+    setRight(shuffled[1] && null);
     setGames(shuffled);
     setBufferIndex(2);

[Survived] BlockStatement
src/App.jsx:110:43
     setScreen("game");
   }
 
-  async function markPickOnServer(gameId) {
-    if (!gameId) return;
-    try {
-      const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });
-      if (r.ok) return true;
-      const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
-      return r2.ok;
-    } catch (e) {
-      return false;
-    }
-  }
+  async function markPickOnServer(gameId) {}
 
   function incrementVote(gameObj) {

[Survived] ConditionalExpression
src/App.jsx:111:9
   }
 
   async function markPickOnServer(gameId) {
-    if (!gameId) return;
+    if (false) return;
     try {
       const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });

[Survived] ConditionalExpression
src/App.jsx:111:9
   }
 
   async function markPickOnServer(gameId) {
-    if (!gameId) return;
+    if (true) return;
     try {
       const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });

[Survived] BlockStatement
src/App.jsx:112:9
 
   async function markPickOnServer(gameId) {
     if (!gameId) return;
-    try {
-      const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });
-      if (r.ok) return true;
-      const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
-      return r2.ok;
-    } catch (e) {
+    try {} catch (e) {
       return false;
     }

[Survived] ConditionalExpression
src/App.jsx:114:11
     if (!gameId) return;
     try {
       const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });
-      if (r.ok) return true;
+      if (false) return true;
       const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
       return r2.ok;

[Survived] ConditionalExpression
src/App.jsx:114:11
     if (!gameId) return;
     try {
       const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });
-      if (r.ok) return true;
+      if (true) return true;
       const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
       return r2.ok;

[Survived] StringLiteral
src/App.jsx:115:72
     try {
       const r = await fetch(`${BASE_API}/pick/${gameId}`, { method: "POST" });
       if (r.ok) return true;
-      const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
+      const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "" });
       return r2.ok;
     } catch (e) {

[Survived] BlockStatement
src/App.jsx:117:17
       if (r.ok) return true;
       const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
       return r2.ok;
-    } catch (e) {
-      return false;
-    }
+    } catch (e) {}
   }
 

[Survived] BooleanLiteral
src/App.jsx:118:14
       const r2 = await fetch(`${BASE_API}/${gameId}/select`, { method: "POST" });
       return r2.ok;
     } catch (e) {
-      return false;
+      return true;
     }
   }

[Survived] BlockStatement
src/App.jsx:122:35
     }
   }
 
-  function incrementVote(gameObj) {
-    setVotesMap(prev => {
-      const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
-      const copy = { ...prev };
-      if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
-      copy[id].count = (copy[id].count || 0) + 1;
-      return copy;
-    });
-  }
+  function incrementVote(gameObj) {}
 
   function getNextFromBuffer() {

[Survived] BlockStatement
src/App.jsx:123:25
   }
 
   function incrementVote(gameObj) {
-    setVotesMap(prev => {
-      const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
-      const copy = { ...prev };
-      if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
-      copy[id].count = (copy[id].count || 0) + 1;
-      return copy;
-    });
+    setVotesMap(prev => {});
   }
 

[Survived] LogicalOperator
src/App.jsx:124:18
 
   function incrementVote(gameObj) {
     setVotesMap(prev => {
-      const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
+      const id = (gameObj._id ?? gameObj.id ?? gameObj.externalId) && gameObj.name;
       const copy = { ...prev };
       if (!copy[id]) copy[id] = { game: gameObj, count: 0 };

[Survived] LogicalOperator
src/App.jsx:124:18
 
   function incrementVote(gameObj) {
     setVotesMap(prev => {
-      const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
+      const id = gameObj._id && gameObj.id ?? gameObj.externalId ?? gameObj.name;
       const copy = { ...prev };
       if (!copy[id]) copy[id] = { game: gameObj, count: 0 };

[Survived] ObjectLiteral
src/App.jsx:125:20
   function incrementVote(gameObj) {
     setVotesMap(prev => {
       const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
-      const copy = { ...prev };
+      const copy = {};
       if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
       copy[id].count = (copy[id].count || 0) + 1;

[Survived] ConditionalExpression
src/App.jsx:126:11
     setVotesMap(prev => {
       const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
       const copy = { ...prev };
-      if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
+      if (true) copy[id] = { game: gameObj, count: 0 };
       copy[id].count = (copy[id].count || 0) + 1;
       return copy;

[Survived] ConditionalExpression
src/App.jsx:126:11
     setVotesMap(prev => {
       const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
       const copy = { ...prev };
-      if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
+      if (false) copy[id] = { game: gameObj, count: 0 };
       copy[id].count = (copy[id].count || 0) + 1;
       return copy;

[Survived] ConditionalExpression
src/App.jsx:127:25
       const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
       const copy = { ...prev };
       if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
-      copy[id].count = (copy[id].count || 0) + 1;
+      copy[id].count = (true) + 1;
       return copy;
     });

[Survived] ConditionalExpression
src/App.jsx:127:25
       const id = gameObj._id ?? gameObj.id ?? gameObj.externalId ?? gameObj.name;
       const copy = { ...prev };
       if (!copy[id]) copy[id] = { game: gameObj, count: 0 };
-      copy[id].count = (copy[id].count || 0) + 1;
+      copy[id].count = (false) + 1;
       return copy;
     });

[Survived] BlockStatement
src/App.jsx:132:32
     });
   }
 
-  function getNextFromBuffer() {
-    if (bufferIndex >= games.length) return null;
-    const next = games[bufferIndex];
-    setBufferIndex(idx => idx + 1);
-    return next;
-  }
+  function getNextFromBuffer() {}
 
   // nueva lógica chooseGame según si champion existe o no

[Survived] ConditionalExpression
src/App.jsx:133:9
   }
 
   function getNextFromBuffer() {
-    if (bufferIndex >= games.length) return null;
+    if (false) return null;
     const next = games[bufferIndex];
     setBufferIndex(idx => idx + 1);

[Survived] EqualityOperator
src/App.jsx:133:9
   }
 
   function getNextFromBuffer() {
-    if (bufferIndex >= games.length) return null;
+    if (bufferIndex > games.length) return null;
     const next = games[bufferIndex];
     setBufferIndex(idx => idx + 1);

[Survived] ArithmeticOperator
src/App.jsx:135:27
   function getNextFromBuffer() {
     if (bufferIndex >= games.length) return null;
     const next = games[bufferIndex];
-    setBufferIndex(idx => idx + 1);
+    setBufferIndex(idx => idx - 1);
     return next;
   }

[Survived] ArrowFunction
src/App.jsx:135:20
   function getNextFromBuffer() {
     if (bufferIndex >= games.length) return null;
     const next = games[bufferIndex];
-    setBufferIndex(idx => idx + 1);
+    setBufferIndex(() => undefined);
     return next;
   }

[Survived] ConditionalExpression
src/App.jsx:142:9
   // nueva lógica chooseGame según si champion existe o no
   // Reemplaza la función chooseGame actual por esta exacta en App.jsx
   async function chooseGame(selected) {
-    if (!selected) return;
+    if (false) return;
     // intento marcar en servidor (no bloquea la UI)
     markPickOnServer(selected._id ?? selected.id).catch(() => { });

[Survived] ConditionalExpression
src/App.jsx:142:9
   // nueva lógica chooseGame según si champion existe o no
   // Reemplaza la función chooseGame actual por esta exacta en App.jsx
   async function chooseGame(selected) {
-    if (!selected) return;
+    if (true) return;
     // intento marcar en servidor (no bloquea la UI)
     markPickOnServer(selected._id ?? selected.id).catch(() => { });

[Survived] LogicalOperator
src/App.jsx:144:22
   async function chooseGame(selected) {
     if (!selected) return;
     // intento marcar en servidor (no bloquea la UI)
-    markPickOnServer(selected._id ?? selected.id).catch(() => { });
+    markPickOnServer(selected._id && selected.id).catch(() => { });
 
     // Obtener siguiente del buffer de forma inmediata

[Survived] BlockStatement
src/App.jsx:150:20
     const nextFromBuffer = getNextFromBuffer(); // esto también incrementa bufferIndex
 
     // Caso 1: todavía no hay champion (primera elección)
-    if (!champion) {
-      // promovemos el seleccionado a champion
-      setChampion(selected);
-      incrementVote(selected);
-
-      // La derecha deberá ser el siguiente del buffer si existe,
-      // si no hay siguiente, usamos el "otro" que estaba en pantalla (si existe)
-      const other = (left && (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
-      // Si nextFromBuffer existe, lo ponemos en right; si no, ponemos 'other' (posible null)
-      setRight(nextFromBuffer ?? other ?? null);
-
-      // limpiamos left (ya no se usa cuando champion existe)
-      setLeft(null);
-
-    } else {
+    if (!champion) {} else {
       // Caso 2: ya hay champion
       const selectedId = selected._id ?? selected.id;

[Survived] ConditionalExpression
src/App.jsx:150:9
     const nextFromBuffer = getNextFromBuffer(); // esto también incrementa bufferIndex
 
     // Caso 1: todavía no hay champion (primera elección)
-    if (!champion) {
+    if (true) {
       // promovemos el seleccionado a champion
       setChampion(selected);

[Survived] ConditionalExpression
src/App.jsx:157:22
 
       // La derecha deberá ser el siguiente del buffer si existe,
       // si no hay siguiente, usamos el "otro" que estaba en pantalla (si existe)
-      const other = (left && (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
+      const other = (true) ? right : left;
       // Si nextFromBuffer existe, lo ponemos en right; si no, ponemos 'other' (posible null)
       setRight(nextFromBuffer ?? other ?? null);

[Survived] LogicalOperator
src/App.jsx:157:22
 
       // La derecha deberá ser el siguiente del buffer si existe,
       // si no hay siguiente, usamos el "otro" que estaba en pantalla (si existe)
-      const other = (left && (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
+      const other = (left || (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
       // Si nextFromBuffer existe, lo ponemos en right; si no, ponemos 'other' (posible null)
       setRight(nextFromBuffer ?? other ?? null);

[Survived] LogicalOperator
src/App.jsx:159:16
       // si no hay siguiente, usamos el "otro" que estaba en pantalla (si existe)
       const other = (left && (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
       // Si nextFromBuffer existe, lo ponemos en right; si no, ponemos 'other' (posible null)
-      setRight(nextFromBuffer ?? other ?? null);
+      setRight((nextFromBuffer ?? other) && null);
 
       // limpiamos left (ya no se usa cuando champion existe)

[Survived] LogicalOperator
src/App.jsx:159:16
       // si no hay siguiente, usamos el "otro" que estaba en pantalla (si existe)
       const other = (left && (left._id ?? left.id) === (selected._id ?? selected.id)) ? right : left;
       // Si nextFromBuffer existe, lo ponemos en right; si no, ponemos 'other' (posible null)
-      setRight(nextFromBuffer ?? other ?? null);
+      setRight(nextFromBuffer && other ?? null);
 
       // limpiamos left (ya no se usa cuando champion existe)

[Survived] BlockStatement
src/App.jsx:164:12
       // limpiamos left (ya no se usa cuando champion existe)
       setLeft(null);
 
-    } else {
-      // Caso 2: ya hay champion
-      const selectedId = selected._id ?? selected.id;
-      const championId = champion._id ?? champion.id;
-      const rightId = right ? (right._id ?? right.id) : null;
-
-      if (selectedId === championId) {
-        // reafirmar champion: incrementamos y reemplazamos right por nextFromBuffer
-        incrementVote(champion);
-        setRight(nextFromBuffer ?? null);
-
-      } else if (selectedId === rightId) {
-        // el opponent gana: lo promovemos a champion
-        incrementVote(selected);
-        setChampion(selected);
-        // ponemos como right el siguiente del buffer (o null si no hay)
-        setRight(nextFromBuffer ?? null);
-      } else {
-        // caso raro: selecciona un juego que no es ni champion ni right
-        incrementVote(selected);
-        setChampion(selected);
-        setRight(nextFromBuffer ?? null);
-      }
-    }
+    } else {}
 
     // contador y límite

[Survived] LogicalOperator
src/App.jsx:166:26
 
     } else {
       // Caso 2: ya hay champion
-      const selectedId = selected._id ?? selected.id;
+      const selectedId = selected._id && selected.id;
       const championId = champion._id ?? champion.id;
       const rightId = right ? (right._id ?? right.id) : null;

[Survived] LogicalOperator
src/App.jsx:167:26
     } else {
       // Caso 2: ya hay champion
       const selectedId = selected._id ?? selected.id;
-      const championId = champion._id ?? champion.id;
+      const championId = champion._id && champion.id;
       const rightId = right ? (right._id ?? right.id) : null;
 

[Survived] LogicalOperator
src/App.jsx:168:32
       // Caso 2: ya hay champion
       const selectedId = selected._id ?? selected.id;
       const championId = champion._id ?? champion.id;
-      const rightId = right ? (right._id ?? right.id) : null;
+      const rightId = right ? (right._id && right.id) : null;
 
       if (selectedId === championId) {

[Survived] ConditionalExpression
src/App.jsx:170:11
       const championId = champion._id ?? champion.id;
       const rightId = right ? (right._id ?? right.id) : null;
 
-      if (selectedId === championId) {
+      if (true) {
         // reafirmar champion: incrementamos y reemplazamos right por nextFromBuffer
         incrementVote(champion);

[Survived] ConditionalExpression
src/App.jsx:170:11
       const championId = champion._id ?? champion.id;
       const rightId = right ? (right._id ?? right.id) : null;
 
-      if (selectedId === championId) {
+      if (false) {
         // reafirmar champion: incrementamos y reemplazamos right por nextFromBuffer
         incrementVote(champion);

[Survived] LogicalOperator
src/App.jsx:173:18
       if (selectedId === championId) {
         // reafirmar champion: incrementamos y reemplazamos right por nextFromBuffer
         incrementVote(champion);
-        setRight(nextFromBuffer ?? null);
+        setRight(nextFromBuffer && null);
 
       } else if (selectedId === rightId) {
