[Survived] ConditionalExpression
src/App.jsx:175:18
         incrementVote(champion);
         setRight(nextFromBuffer ?? null);
 
-      } else if (selectedId === rightId) {
+      } else if (true) {
         // el opponent gana: lo promovemos a champion
         incrementVote(selected);

[Survived] EqualityOperator
src/App.jsx:175:18
         incrementVote(champion);
         setRight(nextFromBuffer ?? null);
 
-      } else if (selectedId === rightId) {
+      } else if (selectedId !== rightId) {
         // el opponent gana: lo promovemos a champion
         incrementVote(selected);

[Survived] LogicalOperator
src/App.jsx:180:18
         incrementVote(selected);
         setChampion(selected);
         // ponemos como right el siguiente del buffer (o null si no hay)
-        setRight(nextFromBuffer ?? null);
+        setRight(nextFromBuffer && null);
       } else {
         // caso raro: selecciona un juego que no es ni champion ni right

[Survived] BlockStatement
src/App.jsx:181:14
         setChampion(selected);
         // ponemos como right el siguiente del buffer (o null si no hay)
         setRight(nextFromBuffer ?? null);
-      } else {
-        // caso raro: selecciona un juego que no es ni champion ni right
-        incrementVote(selected);
-        setChampion(selected);
-        setRight(nextFromBuffer ?? null);
-      }
+      } else {}
     }
 

[Survived] LogicalOperator
src/App.jsx:185:18
         // caso raro: selecciona un juego que no es ni champion ni right
         incrementVote(selected);
         setChampion(selected);
-        setRight(nextFromBuffer ?? null);
+        setRight(nextFromBuffer && null);
       }
     }

[Survived] BlockStatement
src/App.jsx:190:28
     }
 
     // contador y límite
-    setChoiceCount(prev => {
-      const newCount = prev + 1;
-      if (newCount >= MAX_CHOICES) {
-        setScreen("ranking");
-      }
-      return newCount;
-    });
+    setChoiceCount(prev => {});
   }
 

[Survived] ArithmeticOperator
src/App.jsx:191:24
 
     // contador y límite
     setChoiceCount(prev => {
-      const newCount = prev + 1;
+      const newCount = prev - 1;
       if (newCount >= MAX_CHOICES) {
         setScreen("ranking");

[Survived] EqualityOperator
src/App.jsx:192:11
     // contador y límite
     setChoiceCount(prev => {
       const newCount = prev + 1;
-      if (newCount >= MAX_CHOICES) {
+      if (newCount > MAX_CHOICES) {
         setScreen("ranking");
       }

[Survived] BlockStatement
src/App.jsx:192:36
     // contador y límite
     setChoiceCount(prev => {
       const newCount = prev + 1;
-      if (newCount >= MAX_CHOICES) {
-        setScreen("ranking");
-      }
+      if (newCount >= MAX_CHOICES) {}
       return newCount;
     });

[Survived] StringLiteral
src/App.jsx:193:19
     setChoiceCount(prev => {
       const newCount = prev + 1;
       if (newCount >= MAX_CHOICES) {
-        setScreen("ranking");
+        setScreen("");
       }
       return newCount;

[Survived] BlockStatement
src/App.jsx:200:22
   }
 
 
-  function restart() {
-    const source = games && games.length ? games : mockGames;
-    const shuffled = shuffleArray(source);
-    setGames(shuffled);
-    setChampion(null);
-    setLeft(shuffled[0] ?? null);
-    setRight(shuffled[1] ?? null);
-    setBufferIndex(2);
-    setVotesMap({});
-    setChoiceCount(0);
-    setScreen("home");
-  }
+  function restart() {}
 
   function getRankingArray() {

[Survived] ConditionalExpression
src/App.jsx:201:20
 
 
   function restart() {
-    const source = games && games.length ? games : mockGames;
+    const source = true ? games : mockGames;
     const shuffled = shuffleArray(source);
     setGames(shuffled);

[Survived] ConditionalExpression
src/App.jsx:201:20
 
 
   function restart() {
-    const source = games && games.length ? games : mockGames;
+    const source = false ? games : mockGames;
     const shuffled = shuffleArray(source);
     setGames(shuffled);

[Survived] LogicalOperator
src/App.jsx:205:13
     const shuffled = shuffleArray(source);
     setGames(shuffled);
     setChampion(null);
-    setLeft(shuffled[0] ?? null);
+    setLeft(shuffled[0] && null);
     setRight(shuffled[1] ?? null);
     setBufferIndex(2);

[Survived] BlockStatement
src/App.jsx:213:30
     setScreen("home");
   }
 
-  function getRankingArray() {
-    const arr = Object.values(votesMap).map(v => ({ ...v.game, count: v.count }));
-    arr.sort((a, b) => (b.count || 0) - (a.count || 0));
-    return arr;
-  }
+  function getRankingArray() {}
 
   if (loading) return <div style={{ color: "#fff" }}>Cargando juegos...</div>;

[Survived] ArrowFunction
src/App.jsx:214:45
   }
 
   function getRankingArray() {
-    const arr = Object.values(votesMap).map(v => ({ ...v.game, count: v.count }));
+    const arr = Object.values(votesMap).map(() => undefined);
     arr.sort((a, b) => (b.count || 0) - (a.count || 0));
     return arr;

[Survived] ObjectLiteral
src/App.jsx:214:51
   }
 
   function getRankingArray() {
-    const arr = Object.values(votesMap).map(v => ({ ...v.game, count: v.count }));
+    const arr = Object.values(votesMap).map(v => ({}));
     arr.sort((a, b) => (b.count || 0) - (a.count || 0));
     return arr;

[Survived] MethodExpression
src/App.jsx:215:5
 
   function getRankingArray() {
     const arr = Object.values(votesMap).map(v => ({ ...v.game, count: v.count }));
-    arr.sort((a, b) => (b.count || 0) - (a.count || 0));
+    arr;
     return arr;
   }

[Survived] ArrowFunction
src/App.jsx:215:14
 
   function getRankingArray() {
     const arr = Object.values(votesMap).map(v => ({ ...v.game, count: v.count }));
-    arr.sort((a, b) => (b.count || 0) - (a.count || 0));
+    arr.sort(() => undefined);
     return arr;
   }

[Survived] ConditionalExpression
src/App.jsx:219:7
     return arr;
   }
 
-  if (loading) return <div style={{ color: "#fff" }}>Cargando juegos...</div>;
+  if (true) return <div style={{ color: "#fff" }}>Cargando juegos...</div>;
 
   return (

[Survived] ConditionalExpression
src/App.jsx:219:7
     return arr;
   }
 
-  if (loading) return <div style={{ color: "#fff" }}>Cargando juegos...</div>;
+  if (false) return <div style={{ color: "#fff" }}>Cargando juegos...</div>;
 
   return (

[Survived] LogicalOperator
src/App.jsx:226:8
       <StarsParallax />
       <FloatingBackground />
 
-      {authScreen !== "app" && (
-        <div className="auth-root">
-          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
-          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
-        </div>
-      )}
+      {authScreen !== "app" || <div className="auth-root">
+          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
+          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
+        </div>}
 
       {authScreen === "app" && (

[Survived] ConditionalExpression
src/App.jsx:226:8
       <StarsParallax />
       <FloatingBackground />
 
-      {authScreen !== "app" && (
-        <div className="auth-root">
-          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
-          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
-        </div>
-      )}
+      {true}
 
       {authScreen === "app" && (

[Survived] ArrowFunction
src/App.jsx:228:79
 
       {authScreen !== "app" && (
         <div className="auth-root">
-          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
+          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => undefined} />}
           {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
         </div>

[Survived] EqualityOperator
src/App.jsx:228:12
 
       {authScreen !== "app" && (
         <div className="auth-root">
-          {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
+          {authScreen !== "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
           {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
         </div>

[Survived] ArrowFunction
src/App.jsx:229:102
       {authScreen !== "app" && (
         <div className="auth-root">
           {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
-          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
+          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => undefined} />}
         </div>
       )}

[Survived] ArrowFunction
src/App.jsx:229:63
       {authScreen !== "app" && (
         <div className="auth-root">
           {authScreen === "login" && <Login onLogin={handleLogin} goRegister={() => setAuthScreen("register")} />}
-          {authScreen === "register" && <Register onRegister={() => setAuthScreen("login")} goLogin={() => setAuthScreen("login")} />}
+          {authScreen === "register" && <Register onRegister={() => undefined} goLogin={() => setAuthScreen("login")} />}
         </div>
       )}

[Survived] LogicalOperator
src/App.jsx:233:8
         </div>
       )}
 
-      {authScreen === "app" && (
-        <>
-          {screen === "home" && <Home onStart={start} />}
-
-          {screen === "game" && (
-            <>
-              <div style={{ textAlign: "center", color: "#fff", marginTop: 8 }}>
-                Elección {choiceCount} / {MAX_CHOICES}
-              </div>
-
-              <GameChooser
-                // pasamos champion/opponent si existen; si champion es null, GameChooser usará left/right fallback
-                champion={champion}
-                opponent={right}
-                left={left}
-                right={right}
-                chooseGame={chooseGame}
-              />
-            </>
-          )}
-
-          {screen === "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}
-        </>
-      )}
+      {authScreen === "app" || <>
+          {screen === "home" && <Home onStart={start} />}
+
+          {screen === "game" && <>
+              <div style={{
+      textAlign: "center",
+      color: "#fff",
+      marginTop: 8
+    }}>
+                Elección {choiceCount} / {MAX_CHOICES}
+              </div>
+
+              <GameChooser
+    // pasamos champion/opponent si existen; si champion es null, GameChooser usará left/right fallback
+    champion={champion} opponent={right} left={left} right={right} chooseGame={chooseGame} />
+            </>}
+
+          {screen === "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}
+        </>}
     </>
   );

[Survived] EqualityOperator
src/App.jsx:233:8
         </div>
       )}
 
-      {authScreen === "app" && (
+      {authScreen !== "app" && (
         <>
           {screen === "home" && <Home onStart={start} />}

[Survived] ConditionalExpression
src/App.jsx:235:12
 
       {authScreen === "app" && (
         <>
-          {screen === "home" && <Home onStart={start} />}
+          {true}
 
           {screen === "game" && (

[Survived] ConditionalExpression
src/App.jsx:235:12
 
       {authScreen === "app" && (
         <>
-          {screen === "home" && <Home onStart={start} />}
+          {true && <Home onStart={start} />}
 
           {screen === "game" && (

[Survived] ConditionalExpression
src/App.jsx:237:12
         <>
           {screen === "home" && <Home onStart={start} />}
 
-          {screen === "game" && (
-            <>
-              <div style={{ textAlign: "center", color: "#fff", marginTop: 8 }}>
-                Elección {choiceCount} / {MAX_CHOICES}
-              </div>
-
-              <GameChooser
-                // pasamos champion/opponent si existen; si champion es null, GameChooser usará left/right fallback
-                champion={champion}
-                opponent={right}
-                left={left}
-                right={right}
-                chooseGame={chooseGame}
-              />
-            </>
-          )}
+          {false}
 
           {screen === "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}

[Survived] ConditionalExpression
src/App.jsx:237:12
         <>
           {screen === "home" && <Home onStart={start} />}
 
-          {screen === "game" && (
+          {true && (
             <>
               <div style={{ textAlign: "center", color: "#fff", marginTop: 8 }}>

[Survived] EqualityOperator
src/App.jsx:254:12
             </>
           )}
 
-          {screen === "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}
+          {screen !== "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}
         </>
       )}

[Survived] ConditionalExpression
src/App.jsx:254:12
             </>
           )}
 
-          {screen === "ranking" && <Ranking ranking={getRankingArray()} onRestart={restart} />}
+          {false}
         </>
       )}
