[Survived] ConditionalExpression
src/components/GameCard.jsx:6:7
 
 export default function GameCard({ game, onSelect }) {
   // Protección: si llega undefined, devolvemos un placeholder (no crash)
-  if (!game) {
+  if (true) {
     return (
       <div className="game-card placeholder" style={{ width: 280, height: 420, display: "flex", alignItems: "center", justifyContent: "center", color: "#fff", opacity: 0.6 }}>

[Survived] BlockStatement
src/components/GameCard.jsx:6:14
 
 export default function GameCard({ game, onSelect }) {
   // Protección: si llega undefined, devolvemos un placeholder (no crash)
-  if (!game) {
-    return (
-      <div className="game-card placeholder" style={{ width: 280, height: 420, display: "flex", alignItems: "center", justifyContent: "center", color: "#fff", opacity: 0.6 }}>
-        Cargando juego...
-      </div>
-    );
-  }
+  if (!game) {}
 
   // Normalizaciones seguras

[Survived] ObjectLiteral
src/components/GameCard.jsx:8:53
   // Protección: si llega undefined, devolvemos un placeholder (no crash)
   if (!game) {
     return (
-      <div className="game-card placeholder" style={{ width: 280, height: 420, display: "flex", alignItems: "center", justifyContent: "center", color: "#fff", opacity: 0.6 }}>
+      <div className="game-card placeholder" style={{}}>
         Cargando juego...
       </div>

[Survived] LogicalOperator
src/components/GameCard.jsx:15:16
   }
 
   // Normalizaciones seguras
-  const name = game.name ?? game.title ?? "Sin título";
+  const name = (game.name ?? game.title) && "Sin título";
   const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
   const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;

[Survived] LogicalOperator
src/components/GameCard.jsx:15:16
   }
 
   // Normalizaciones seguras
-  const name = game.name ?? game.title ?? "Sin título";
+  const name = game.name && game.title ?? "Sin título";
   const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
   const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;

[Survived] LogicalOperator
src/components/GameCard.jsx:16:18
 
   // Normalizaciones seguras
   const name = game.name ?? game.title ?? "Sin título";
-  const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
+  const rawImg = (game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover) && "";
   const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;
   const genres = Array.isArray(game.genres) ? game.genres : (game.genre ? [game.genre] : []);

[Survived] LogicalOperator
src/components/GameCard.jsx:16:18
 
   // Normalizaciones seguras
   const name = game.name ?? game.title ?? "Sin título";
-  const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
+  const rawImg = (game.image ?? game.coverUrl) && game.thumbnail ?? game.cover ?? "";
   const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;
   const genres = Array.isArray(game.genres) ? game.genres : (game.genre ? [game.genre] : []);

[Survived] MethodExpression
src/components/GameCard.jsx:17:62
   // Normalizaciones seguras
   const name = game.name ?? game.title ?? "Sin título";
   const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
-  const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;
+  const img = typeof rawImg === "string" && rawImg.length ? (rawImg.endsWith("//") ? `https:${rawImg}` : rawImg) : null;
   const genres = Array.isArray(game.genres) ? game.genres : (game.genre ? [game.genre] : []);
 

[Survived] LogicalOperator
src/components/GameCard.jsx:17:15
   // Normalizaciones seguras
   const name = game.name ?? game.title ?? "Sin título";
   const rawImg = game.image ?? game.coverUrl ?? game.thumbnail ?? game.cover ?? "";
-  const img = typeof rawImg === "string" && rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;
+  const img = typeof rawImg === "string" || rawImg.length ? (rawImg.startsWith("//") ? `https:${rawImg}` : rawImg) : null;
   const genres = Array.isArray(game.genres) ? game.genres : (game.genre ? [game.genre] : []);
 

[Survived] BlockStatement
src/components/GameCard.jsx:21:7
   const genres = Array.isArray(game.genres) ? game.genres : (game.genre ? [game.genre] : []);
 
   // Preload no-crash (envuelto en try/catch)
-  try {
-    if (img) {
-      const pre = new Image();
-      pre.src = img;
-    }
-  } catch (e) {
+  try {} catch (e) {
     // no hacemos nada; no bloquear UI
     // console.warn("Preload image failed", e);

[Survived] ConditionalExpression
src/components/GameCard.jsx:22:9
 
   // Preload no-crash (envuelto en try/catch)
   try {
-    if (img) {
+    if (false) {
       const pre = new Image();
       pre.src = img;

[Survived] BlockStatement
src/components/GameCard.jsx:22:14
 
   // Preload no-crash (envuelto en try/catch)
   try {
-    if (img) {
-      const pre = new Image();
-      pre.src = img;
-    }
+    if (img) {}
   } catch (e) {
     // no hacemos nada; no bloquear UI

[Survived] ObjectLiteral
src/components/GameCard.jsx:33:18
 
   return (
     <div className="game-card" style={{ width: 280, padding: 16, textAlign: "center", color: "#fff" }}>
-      <h4 style={{ marginBottom: 10 }}>{name}</h4>
+      <h4 style={{}}>{name}</h4>
       {img ? (
         <img src={img} alt={name} style={{ width: 220, height: 130, objectFit: "cover", display: "block", margin: "0 auto 12px" }} />

[Survived] StringLiteral
src/components/GameCard.jsx:37:60
       {img ? (
         <img src={img} alt={name} style={{ width: 220, height: 130, objectFit: "cover", display: "block", margin: "0 auto 12px" }} />
       ) : (
-        <div style={{ width: 220, height: 130, background: "#222", display: "flex", alignItems: "center", justifyContent: "center", margin: "0 auto 12px" }}>
+        <div style={{ width: 220, height: 130, background: "", display: "flex", alignItems: "center", justifyContent: "center", margin: "0 auto 12px" }}>
           Sin imagen
         </div>

[Survived] StringLiteral
src/components/GameCard.jsx:37:123
       {img ? (
         <img src={img} alt={name} style={{ width: 220, height: 130, objectFit: "cover", display: "block", margin: "0 auto 12px" }} />
       ) : (
-        <div style={{ width: 220, height: 130, background: "#222", display: "flex", alignItems: "center", justifyContent: "center", margin: "0 auto 12px" }}>
+        <div style={{ width: 220, height: 130, background: "#222", display: "flex", alignItems: "center", justifyContent: "", margin: "0 auto 12px" }}>
           Sin imagen
         </div>

[Survived] ObjectLiteral
src/components/GameCard.jsx:41:17
           Sin imagen
         </div>
       )}
-      <p style={{ marginBottom: 14, opacity: 0.9 }}>{genres.length ? genres.join(" • ") : "Género desconocido"}</p>
+      <p style={{}}>{genres.length ? genres.join(" • ") : "Género desconocido"}</p>
       <button onClick={() => onSelect && onSelect()} style={{ padding: "10px 16px", borderRadius: 6, cursor: "pointer" }}>Elegir</button>
     </div>

[Survived] ConditionalExpression
src/components/GameCard.jsx:42:30
         </div>
       )}
       <p style={{ marginBottom: 14, opacity: 0.9 }}>{genres.length ? genres.join(" • ") : "Género desconocido"}</p>
-      <button onClick={() => onSelect && onSelect()} style={{ padding: "10px 16px", borderRadius: 6, cursor: "pointer" }}>Elegir</button>
+      <button onClick={() => true} style={{ padding: "10px 16px", borderRadius: 6, cursor: "pointer" }}>Elegir</button>
     </div>
   );

[Survived] LogicalOperator
src/components/GameCard.jsx:42:30
         </div>
       )}
       <p style={{ marginBottom: 14, opacity: 0.9 }}>{genres.length ? genres.join(" • ") : "Género desconocido"}</p>
-      <button onClick={() => onSelect && onSelect()} style={{ padding: "10px 16px", borderRadius: 6, cursor: "pointer" }}>Elegir</button>
+      <button onClick={() => onSelect || onSelect()} style={{ padding: "10px 16px", borderRadius: 6, cursor: "pointer" }}>Elegir</button>
     </div>
   );
