[Survived] StringLiteral
src/components/StarsParallax.jsx:8:35
 
   useEffect(() => {
     const canvas = canvasRef.current;
-    const ctx = canvas.getContext("2d");
+    const ctx = canvas.getContext("");
 
     // Ajustar tamaño del canvas

[Survived] ObjectLiteral
src/components/StarsParallax.jsx:16:7
 
     // Crear 3 capas de estrellas con diferentes velocidades (parallax)
     const starLayers = [
-      { stars: [], count: 100, speed: 0.2, size: 1, opacity: 0.5 },
+      {},
       { stars: [], count: 70, speed: 0.5, size: 1.5, opacity: 0.7 },
       { stars: [], count: 40, speed: 1, size: 2.5, opacity: 1 },

[Survived] ArrayDeclaration
src/components/StarsParallax.jsx:18:16
     const starLayers = [
       { stars: [], count: 100, speed: 0.2, size: 1, opacity: 0.5 },
       { stars: [], count: 70, speed: 0.5, size: 1.5, opacity: 0.7 },
-      { stars: [], count: 40, speed: 1, size: 2.5, opacity: 1 },
+      { stars: ["Stryker was here"], count: 40, speed: 1, size: 2.5, opacity: 1 },
     ];
 

[Survived] BlockStatement
src/components/StarsParallax.jsx:22:35
     ];
 
     // Generar estrellas aleatorias
-    starLayers.forEach((layer) => {
-      for (let i = 0; i < layer.count; i++) {
-        layer.stars.push({
-          x: Math.random() * canvas.width,
-          y: Math.random() * canvas.height,
-          brightness: Math.random() * 0.5 + 0.5, // Parpadeo
-        });
-      }
-    });
+    starLayers.forEach((layer) => {});
 
     let mouseX = 0;

[Survived] UpdateOperator
src/components/StarsParallax.jsx:23:40
 
     // Generar estrellas aleatorias
     starLayers.forEach((layer) => {
-      for (let i = 0; i < layer.count; i++) {
+      for (let i = 0; i < layer.count; i--) {
         layer.stars.push({
           x: Math.random() * canvas.width,

[Survived] BlockStatement
src/components/StarsParallax.jsx:23:45
 
     // Generar estrellas aleatorias
     starLayers.forEach((layer) => {
-      for (let i = 0; i < layer.count; i++) {
-        layer.stars.push({
-          x: Math.random() * canvas.width,
-          y: Math.random() * canvas.height,
-          brightness: Math.random() * 0.5 + 0.5, // Parpadeo
-        });
-      }
+      for (let i = 0; i < layer.count; i++) {}
     });
 

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:25:14
     starLayers.forEach((layer) => {
       for (let i = 0; i < layer.count; i++) {
         layer.stars.push({
-          x: Math.random() * canvas.width,
+          x: Math.random() / canvas.width,
           y: Math.random() * canvas.height,
           brightness: Math.random() * 0.5 + 0.5, // Parpadeo

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:26:14
       for (let i = 0; i < layer.count; i++) {
         layer.stars.push({
           x: Math.random() * canvas.width,
-          y: Math.random() * canvas.height,
+          y: Math.random() / canvas.height,
           brightness: Math.random() * 0.5 + 0.5, // Parpadeo
         });

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:27:23
         layer.stars.push({
           x: Math.random() * canvas.width,
           y: Math.random() * canvas.height,
-          brightness: Math.random() * 0.5 + 0.5, // Parpadeo
+          brightness: Math.random() * 0.5 - 0.5, // Parpadeo
         });
       }

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:27:23
         layer.stars.push({
           x: Math.random() * canvas.width,
           y: Math.random() * canvas.height,
-          brightness: Math.random() * 0.5 + 0.5, // Parpadeo
+          brightness: Math.random() / 0.5 + 0.5, // Parpadeo
         });
       }

[Survived] BlockStatement
src/components/StarsParallax.jsx:36:36
     let mouseY = 0;
 
     // Seguir el mouse para efecto parallax
-    const handleMouseMove = (e) => {
-      mouseX = (e.clientX - canvas.width / 2) * 0.01;
-      mouseY = (e.clientY - canvas.height / 2) * 0.01;
-    };
+    const handleMouseMove = (e) => {};
 
     window.addEventListener("mousemove", handleMouseMove);

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:37:16
 
     // Seguir el mouse para efecto parallax
     const handleMouseMove = (e) => {
-      mouseX = (e.clientX - canvas.width / 2) * 0.01;
+      mouseX = (e.clientX - canvas.width / 2) / 0.01;
       mouseY = (e.clientY - canvas.height / 2) * 0.01;
     };

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:37:29
 
     // Seguir el mouse para efecto parallax
     const handleMouseMove = (e) => {
-      mouseX = (e.clientX - canvas.width / 2) * 0.01;
+      mouseX = (e.clientX - canvas.width * 2) * 0.01;
       mouseY = (e.clientY - canvas.height / 2) * 0.01;
     };

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:38:29
     // Seguir el mouse para efecto parallax
     const handleMouseMove = (e) => {
       mouseX = (e.clientX - canvas.width / 2) * 0.01;
-      mouseY = (e.clientY - canvas.height / 2) * 0.01;
+      mouseY = (e.clientY - canvas.height * 2) * 0.01;
     };
 

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:38:16
     // Seguir el mouse para efecto parallax
     const handleMouseMove = (e) => {
       mouseX = (e.clientX - canvas.width / 2) * 0.01;
-      mouseY = (e.clientY - canvas.height / 2) * 0.01;
+      mouseY = (e.clientY - canvas.height / 2) / 0.01;
     };
 

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:51:27
       starLayers.forEach((layer) => {
         layer.stars.forEach((star) => {
           // Efecto parallax con el mouse
-          const offsetX = mouseX * layer.speed;
+          const offsetX = mouseX / layer.speed;
           const offsetY = mouseY * layer.speed;
 

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:52:27
         layer.stars.forEach((star) => {
           // Efecto parallax con el mouse
           const offsetX = mouseX * layer.speed;
-          const offsetY = mouseY * layer.speed;
+          const offsetY = mouseY / layer.speed;
 
           // Parpadeo suave

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:55:30
           const offsetY = mouseY * layer.speed;
 
           // Parpadeo suave
-          star.brightness += (Math.random() - 0.5) * 0.03;
+          star.brightness += (Math.random() - 0.5) / 0.03;
           star.brightness = Math.max(0.3, Math.min(1, star.brightness));
 

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:55:31
           const offsetY = mouseY * layer.speed;
 
           // Parpadeo suave
-          star.brightness += (Math.random() - 0.5) * 0.03;
+          star.brightness += (Math.random() + 0.5) * 0.03;
           star.brightness = Math.max(0.3, Math.min(1, star.brightness));
 

[Survived] MethodExpression
src/components/StarsParallax.jsx:56:43
 
           // Parpadeo suave
           star.brightness += (Math.random() - 0.5) * 0.03;
-          star.brightness = Math.max(0.3, Math.min(1, star.brightness));
+          star.brightness = Math.max(0.3, Math.max(1, star.brightness));
 
           // Dibujar estrella

[Survived] MethodExpression
src/components/StarsParallax.jsx:56:29
 
           // Parpadeo suave
           star.brightness += (Math.random() - 0.5) * 0.03;
-          star.brightness = Math.max(0.3, Math.min(1, star.brightness));
+          star.brightness = Math.min(0.3, Math.min(1, star.brightness));
 
           // Dibujar estrella

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:61:13
           // Dibujar estrella
           ctx.beginPath();
           ctx.arc(
-            star.x + offsetX,
+            star.x - offsetX,
             star.y + offsetY,
             layer.size,

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:62:13
           ctx.beginPath();
           ctx.arc(
             star.x + offsetX,
-            star.y + offsetY,
+            star.y - offsetY,
             layer.size,
             0,

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:65:13
             star.y + offsetY,
             layer.size,
             0,
-            Math.PI * 2
+            Math.PI / 2
           );
 

[Survived] BlockStatement
src/components/StarsParallax.jsx:71:34
           // Color con efecto neón (magenta/cyan)
           const colorChoice = Math.random();
           let color;
-          if (colorChoice > 0.7) {
-            color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
-          } else if (colorChoice > 0.4) {
+          if (colorChoice > 0.7) {} else if (colorChoice > 0.4) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
           } else {

[Survived] ConditionalExpression
src/components/StarsParallax.jsx:71:15
           // Color con efecto neón (magenta/cyan)
           const colorChoice = Math.random();
           let color;
-          if (colorChoice > 0.7) {
+          if (false) {
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
           } else if (colorChoice > 0.4) {

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:72:42
           const colorChoice = Math.random();
           let color;
           if (colorChoice > 0.7) {
-            color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
+            color = `rgba(255, 0, 230, ${layer.opacity / star.brightness})`; // Magenta
           } else if (colorChoice > 0.4) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan

[Survived] ConditionalExpression
src/components/StarsParallax.jsx:73:22
           let color;
           if (colorChoice > 0.7) {
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
-          } else if (colorChoice > 0.4) {
+          } else if (false) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
           } else {

[Survived] ConditionalExpression
src/components/StarsParallax.jsx:73:22
           let color;
           if (colorChoice > 0.7) {
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
-          } else if (colorChoice > 0.4) {
+          } else if (true) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
           } else {

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:74:42
           if (colorChoice > 0.7) {
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
           } else if (colorChoice > 0.4) {
-            color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
+            color = `rgba(0, 200, 255, ${layer.opacity / star.brightness})`; // Cyan
           } else {
             color = `rgba(255, 255, 255, ${layer.opacity * star.brightness})`; // Blanco

[Survived] StringLiteral
src/components/StarsParallax.jsx:74:21
           if (colorChoice > 0.7) {
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
           } else if (colorChoice > 0.4) {
-            color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
+            color = ``; // Cyan
           } else {
             color = `rgba(255, 255, 255, ${layer.opacity * star.brightness})`; // Blanco

[Survived] BlockStatement
src/components/StarsParallax.jsx:75:18
             color = `rgba(255, 0, 230, ${layer.opacity * star.brightness})`; // Magenta
           } else if (colorChoice > 0.4) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
-          } else {
-            color = `rgba(255, 255, 255, ${layer.opacity * star.brightness})`; // Blanco
-          }
+          } else {}
 
           ctx.fillStyle = color;

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:76:44
           } else if (colorChoice > 0.4) {
             color = `rgba(0, 200, 255, ${layer.opacity * star.brightness})`; // Cyan
           } else {
-            color = `rgba(255, 255, 255, ${layer.opacity * star.brightness})`; // Blanco
+            color = `rgba(255, 255, 255, ${layer.opacity / star.brightness})`; // Blanco
           }
 

[Survived] AssignmentOperator
src/components/StarsParallax.jsx:85:11
           ctx.fill();
 
           // Movimiento lento hacia abajo
-          star.y += layer.speed * 0.1;
+          star.y -= layer.speed * 0.1;
 
           // Resetear si sale de la pantalla

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:85:21
           ctx.fill();
 
           // Movimiento lento hacia abajo
-          star.y += layer.speed * 0.1;
+          star.y += layer.speed / 0.1;
 
           // Resetear si sale de la pantalla

[Survived] ConditionalExpression
src/components/StarsParallax.jsx:88:15
           star.y += layer.speed * 0.1;
 
           // Resetear si sale de la pantalla
-          if (star.y > canvas.height) {
+          if (true) {
             star.y = 0;
             star.x = Math.random() * canvas.width;

[Survived] EqualityOperator
src/components/StarsParallax.jsx:88:15
           star.y += layer.speed * 0.1;
 
           // Resetear si sale de la pantalla
-          if (star.y > canvas.height) {
+          if (star.y >= canvas.height) {
             star.y = 0;
             star.x = Math.random() * canvas.width;

[Survived] ArithmeticOperator
src/components/StarsParallax.jsx:90:22
           // Resetear si sale de la pantalla
           if (star.y > canvas.height) {
             star.y = 0;
-            star.x = Math.random() * canvas.width;
+            star.x = Math.random() / canvas.width;
           }
         });

[Survived] BlockStatement
src/components/StarsParallax.jsx:101:32
     animate();
 
     // Ajustar tamaño al cambiar ventana
-    const handleResize = () => {
-      canvas.width = window.innerWidth;
-      canvas.height = window.innerHeight;
-    };
+    const handleResize = () => {};
 
     window.addEventListener("resize", handleResize);

[Survived] BlockStatement
src/components/StarsParallax.jsx:109:18
     window.addEventListener("resize", handleResize);
 
     // Cleanup
-    return () => {
-      window.removeEventListener("mousemove", handleMouseMove);
-      window.removeEventListener("resize", handleResize);
-    };
+    return () => {};
   }, []);
 

[Survived] StringLiteral
src/components/StarsParallax.jsx:123:17
         top: 0,
         left: 0,
         width: "100%",
-        height: "100%",
+        height: "",
         pointerEvents: "none",
         zIndex: 1,

[Survived] StringLiteral
src/components/StarsParallax.jsx:124:24
         left: 0,
         width: "100%",
         height: "100%",
-        pointerEvents: "none",
+        pointerEvents: "",
         zIndex: 1,
       }}
