[Survived] ObjectLiteral
src/mock/games.js:2:3
 export const mockGames = [
-  {
-    id: 1,
-    name: "Neon Runner",
-    image: "https://via.placeholder.com/300x400/ff00e6/ffffff?text=Neon+Runner",
-    genres: ["Action", "Sci-fi"]
-  },
+  {},
   {
     id: 2,

[Survived] StringLiteral
src/mock/games.js:6:24
     id: 1,
     name: "Neon Runner",
     image: "https://via.placeholder.com/300x400/ff00e6/ffffff?text=Neon+Runner",
-    genres: ["Action", "Sci-fi"]
+    genres: ["Action", ""]
   },
   {

[Survived] ObjectLiteral
src/mock/games.js:8:3
     image: "https://via.placeholder.com/300x400/ff00e6/ffffff?text=Neon+Runner",
     genres: ["Action", "Sci-fi"]
   },
-  {
-    id: 2,
-    name: "Pixel Galaxy",
-    image: "https://via.placeholder.com/300x400/00c8ff/ffffff?text=Pixel+Galaxy",
-    genres: ["Arcade", "Retro"]
-  },
+  {},
   {
     id: 3,

[Survived] StringLiteral
src/mock/games.js:11:12
   {
     id: 2,
     name: "Pixel Galaxy",
-    image: "https://via.placeholder.com/300x400/00c8ff/ffffff?text=Pixel+Galaxy",
+    image: "",
     genres: ["Arcade", "Retro"]
   },

[Survived] StringLiteral
src/mock/games.js:12:24
     id: 2,
     name: "Pixel Galaxy",
     image: "https://via.placeholder.com/300x400/00c8ff/ffffff?text=Pixel+Galaxy",
-    genres: ["Arcade", "Retro"]
+    genres: ["Arcade", ""]
   },
   {

[Survived] ArrayDeclaration
src/mock/games.js:18:13
     id: 3,
     name: "Synthwave Drift",
     image: "https://via.placeholder.com/300x400/ff8800/ffffff?text=Synthwave+Drift",
-    genres: ["Racing", "Futuristic"]
+    genres: []
   },
   {

[Survived] StringLiteral
src/mock/games.js:18:14
     id: 3,
     name: "Synthwave Drift",
     image: "https://via.placeholder.com/300x400/ff8800/ffffff?text=Synthwave+Drift",
-    genres: ["Racing", "Futuristic"]
+    genres: ["", "Futuristic"]
   },
   {

[Survived] StringLiteral
src/mock/games.js:24:24
     id: 4,
     name: "Cyber Blade",
     image: "https://via.placeholder.com/300x400/9900ff/ffffff?text=Cyber+Blade",
-    genres: ["Action", "Cyberpunk"]
+    genres: ["Action", ""]
   }
 ];
