[Survived] StringLiteral
src/main.jsx:6:36
 import './index.css'
 import App from './App.jsx'
 
-createRoot(document.getElementById('root')).render(
+createRoot(document.getElementById("")).render(
   <StrictMode>
     <App />
