[Survived] BooleanLiteral
src/pages/GameChooser.jsx:7:23
 
 export default function GameChooser({ champion, opponent, left, right, chooseGame }) {
   // Si champion es null -> usamos left/right (dos cartas iniciales)
-  const hasChampion = !!champion;
+  const hasChampion = !champion;
 
   if (!hasChampion) {

[Survived] BlockStatement
src/pages/GameChooser.jsx:9:21
   // Si champion es null -> usamos left/right (dos cartas iniciales)
   const hasChampion = !!champion;
 
-  if (!hasChampion) {
-    // initial state: left & right must be present
-    if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
-    if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
-
-    return (
-      <div className="chooser scanlines" style={{ padding: "0 24px" }}>
-        <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
-        <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
-          <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
-          <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />
-        </div>
-      </div>
-    );
-  }
+  if (!hasChampion) {}
 
   // champion existe: lo mostramos arriba y el opponent a la derecha

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:9:7
   // Si champion es null -> usamos left/right (dos cartas iniciales)
   const hasChampion = !!champion;
 
-  if (!hasChampion) {
+  if (true) {
     // initial state: left & right must be present
     if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:11:9
 
   if (!hasChampion) {
     // initial state: left & right must be present
-    if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
+    if (true) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
     if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
 

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:11:9
 
   if (!hasChampion) {
     // initial state: left & right must be present
-    if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
+    if (false) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
     if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
 

[Survived] BooleanLiteral
src/pages/GameChooser.jsx:12:18
   if (!hasChampion) {
     // initial state: left & right must be present
     if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
-    if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
+    if (!left || right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
 
     return (

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:12:9
   if (!hasChampion) {
     // initial state: left & right must be present
     if (!left && !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Cargando juegos...</h2>;
-    if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
+    if (false) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
 
     return (

[Survived] ObjectLiteral
src/pages/GameChooser.jsx:15:49
     if (!left || !right) return <h2 style={{ color: "#fff", textAlign: "center" }}>Preparando oponentes...</h2>;
 
     return (
-      <div className="chooser scanlines" style={{ padding: "0 24px" }}>
+      <div className="chooser scanlines" style={{}}>
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>

[Survived] StringLiteral
src/pages/GameChooser.jsx:16:29
 
     return (
       <div className="chooser scanlines" style={{ padding: "0 24px" }}>
-        <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
+        <h2 style={{ color: "", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
           <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />

[Survived] ObjectLiteral
src/pages/GameChooser.jsx:17:39
     return (
       <div className="chooser scanlines" style={{ padding: "0 24px" }}>
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
-        <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
+        <div className="cards" style={{}}>
           <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
           <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />

[Survived] LogicalOperator
src/pages/GameChooser.jsx:18:49
       <div className="chooser scanlines" style={{ padding: "0 24px" }}>
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
-          <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
+          <GameCard game={left} onSelect={() => chooseGame || chooseGame(left)} />
           <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />
         </div>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:18:49
       <div className="chooser scanlines" style={{ padding: "0 24px" }}>
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
-          <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
+          <GameCard game={left} onSelect={() => true} />
           <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />
         </div>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:19:50
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
           <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
-          <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />
+          <GameCard game={right} onSelect={() => false} />
         </div>
       </div>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:19:50
         <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
         <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
           <GameCard game={left} onSelect={() => chooseGame && chooseGame(left)} />
-          <GameCard game={right} onSelect={() => chooseGame && chooseGame(right)} />
+          <GameCard game={right} onSelect={() => true} />
         </div>
       </div>

[Survived] StringLiteral
src/pages/GameChooser.jsx:27:58
 
   // champion existe: lo mostramos arriba y el opponent a la derecha
   return (
-    <div className="chooser scanlines" style={{ padding: "0 24px" }}>
+    <div className="chooser scanlines" style={{ padding: "" }}>
       {champion && (
         <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:28:8
   // champion existe: lo mostramos arriba y el opponent a la derecha
   return (
     <div className="chooser scanlines" style={{ padding: "0 24px" }}>
-      {champion && (
-        <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
-          <img
-            src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
-            alt={champion.title ?? champion.name}
-            style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
-            onError={(e) => { e.target.style.display = "none"; }}
-          />
-          <h3 style={{ color: "#fff" }}>{champion.title ?? champion.name}</h3>
-        </div>
-      )}
+      {true}
 
       <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:28:8
   // champion existe: lo mostramos arriba y el opponent a la derecha
   return (
     <div className="chooser scanlines" style={{ padding: "0 24px" }}>
-      {champion && (
-        <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
-          <img
-            src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
-            alt={champion.title ?? champion.name}
-            style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
-            onError={(e) => { e.target.style.display = "none"; }}
-          />
-          <h3 style={{ color: "#fff" }}>{champion.title ?? champion.name}</h3>
-        </div>
-      )}
+      {false}
 
       <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>

[Survived] ObjectLiteral
src/pages/GameChooser.jsx:29:47
   return (
     <div className="chooser scanlines" style={{ padding: "0 24px" }}>
       {champion && (
-        <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
+        <div className="selected-game" style={{}}>
           <img
             src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:31:18
       {champion && (
         <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
           <img
-            src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
+            src={false}
             alt={champion.title ?? champion.name}
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}

[Survived] LogicalOperator
src/pages/GameChooser.jsx:31:18
       {champion && (
         <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
           <img
-            src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
+            src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) && ""}
             alt={champion.title ?? champion.name}
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}

[Survived] LogicalOperator
src/pages/GameChooser.jsx:32:18
         <div className="selected-game" style={{ textAlign: "center", marginBottom: 20 }}>
           <img
             src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
-            alt={champion.title ?? champion.name}
+            alt={champion.title && champion.name}
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
             onError={(e) => { e.target.style.display = "none"; }}

[Survived] BlockStatement
src/pages/GameChooser.jsx:34:29
             src={(champion.image ?? champion.coverUrl ?? champion.thumbnail) || ""}
             alt={champion.title ?? champion.name}
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
-            onError={(e) => { e.target.style.display = "none"; }}
+            onError={(e) => {}}
           />
           <h3 style={{ color: "#fff" }}>{champion.title ?? champion.name}</h3>

[Survived] LogicalOperator
src/pages/GameChooser.jsx:36:42
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
             onError={(e) => { e.target.style.display = "none"; }}
           />
-          <h3 style={{ color: "#fff" }}>{champion.title ?? champion.name}</h3>
+          <h3 style={{ color: "#fff" }}>{champion.title && champion.name}</h3>
         </div>
       )}

[Survived] ObjectLiteral
src/pages/GameChooser.jsx:36:22
             style={{ width: 300, height: "auto", display: "block", margin: "0 auto 8px" }}
             onError={(e) => { e.target.style.display = "none"; }}
           />
-          <h3 style={{ color: "#fff" }}>{champion.title ?? champion.name}</h3>
+          <h3 style={{}}>{champion.title ?? champion.name}</h3>
         </div>
       )}

[Survived] StringLiteral
src/pages/GameChooser.jsx:40:46
         </div>
       )}
 
-      <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
+      <h2 style={{ color: "#fff", textAlign: "" }}>¿Cuál prefieres?</h2>
 
       <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>

[Survived] StringLiteral
src/pages/GameChooser.jsx:42:48
 
       <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
 
-      <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
+      <div className="cards" style={{ display: "", justifyContent: "center", gap: 40, marginTop: 20 }}>
         <GameCard game={champion} onSelect={() => chooseGame && chooseGame(champion)} />
         <GameCard game={opponent} onSelect={() => chooseGame && chooseGame(opponent)} />

[Survived] LogicalOperator
src/pages/GameChooser.jsx:43:51
       <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
 
       <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
-        <GameCard game={champion} onSelect={() => chooseGame && chooseGame(champion)} />
+        <GameCard game={champion} onSelect={() => chooseGame || chooseGame(champion)} />
         <GameCard game={opponent} onSelect={() => chooseGame && chooseGame(opponent)} />
       </div>

[Survived] ArrowFunction
src/pages/GameChooser.jsx:43:45
       <h2 style={{ color: "#fff", textAlign: "center" }}>¿Cuál prefieres?</h2>
 
       <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
-        <GameCard game={champion} onSelect={() => chooseGame && chooseGame(champion)} />
+        <GameCard game={champion} onSelect={() => undefined} />
         <GameCard game={opponent} onSelect={() => chooseGame && chooseGame(opponent)} />
       </div>

[Survived] LogicalOperator
src/pages/GameChooser.jsx:44:51
 
       <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
         <GameCard game={champion} onSelect={() => chooseGame && chooseGame(champion)} />
-        <GameCard game={opponent} onSelect={() => chooseGame && chooseGame(opponent)} />
+        <GameCard game={opponent} onSelect={() => chooseGame || chooseGame(opponent)} />
       </div>
     </div>

[Survived] ConditionalExpression
src/pages/GameChooser.jsx:44:51
 
       <div className="cards" style={{ display: "flex", justifyContent: "center", gap: 40, marginTop: 20 }}>
         <GameCard game={champion} onSelect={() => chooseGame && chooseGame(champion)} />
-        <GameCard game={opponent} onSelect={() => chooseGame && chooseGame(opponent)} />
+        <GameCard game={opponent} onSelect={() => true} />
       </div>
     </div>
