[Survived] EqualityOperator
src/pages/Ranking.jsx:7:34
 
 export default function Ranking({ ranking = [], onRestart }) {
   // ranking: array de objetos { _id, name, image, count }
-  if (!Array.isArray(ranking) || ranking.length === 0) {
+  if (!Array.isArray(ranking) || ranking.length !== 0) {
     return (
       <div className="ranking-root">

[Survived] ConditionalExpression
src/pages/Ranking.jsx:7:34
 
 export default function Ranking({ ranking = [], onRestart }) {
   // ranking: array de objetos { _id, name, image, count }
-  if (!Array.isArray(ranking) || ranking.length === 0) {
+  if (!Array.isArray(ranking) || false) {
     return (
       <div className="ranking-root">

[Survived] ArrowFunction
src/pages/Ranking.jsx:17:37
   }
 
   // calcular totales y porcentajes
-  const totalVotes = ranking.reduce((s, r) => s + (r.count || 0), 0) || 1;
+  const totalVotes = ranking.reduce(() => undefined, 0) || 1;
   const top3 = ranking.slice(0, 3);
   const rest = ranking.slice(3);

[Survived] ConditionalExpression
src/pages/Ranking.jsx:17:22
   }
 
   // calcular totales y porcentajes
-  const totalVotes = ranking.reduce((s, r) => s + (r.count || 0), 0) || 1;
+  const totalVotes = true;
   const top3 = ranking.slice(0, 3);
   const rest = ranking.slice(3);

[Survived] MethodExpression
src/pages/Ranking.jsx:18:16
 
   // calcular totales y porcentajes
   const totalVotes = ranking.reduce((s, r) => s + (r.count || 0), 0) || 1;
-  const top3 = ranking.slice(0, 3);
+  const top3 = ranking;
   const rest = ranking.slice(3);
 

[Survived] MethodExpression
src/pages/Ranking.jsx:19:16
   // calcular totales y porcentajes
   const totalVotes = ranking.reduce((s, r) => s + (r.count || 0), 0) || 1;
   const top3 = ranking.slice(0, 3);
-  const rest = ranking.slice(3);
+  const rest = ranking;
 
   return (

[Survived] ArrowFunction
src/pages/Ranking.jsx:43:19
 
       {/* Resto en grid con barras */}
       <div className="ranking-list">
-        {rest.map((g, idx) => (
-          <div className="ranking-item" key={g._id ?? g.id ?? idx}>
-            <div className="ranking-item-left">
-              <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />
-              <div className="ranking-meta">
-                <div className="ranking-name">{g.name ?? g.title}</div>
-                <div className="ranking-count">Veces elegido: <strong>{g.count ?? 0}</strong></div>
-              </div>
-            </div>
-
-            <div className="ranking-item-right">
-              <div className="progress-bar" aria-hidden>
-                <div
-                  className="progress-bar-fill"
-                  style={{ width: `${Math.round(((g.count ?? 0) / totalVotes) * 100)}%` }}
-                />
-              </div>
-              <div className="ranking-percent">
-                {((g.count ?? 0) / totalVotes * 100).toFixed(0)}%
-              </div>
-            </div>
-          </div>
-        ))}
+        {rest.map(() => undefined)}
       </div>
 

[Survived] LogicalOperator
src/pages/Ranking.jsx:44:46
       {/* Resto en grid con barras */}
       <div className="ranking-list">
         {rest.map((g, idx) => (
-          <div className="ranking-item" key={g._id ?? g.id ?? idx}>
+          <div className="ranking-item" key={(g._id ?? g.id) && idx}>
             <div className="ranking-item-left">
               <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />

[Survived] LogicalOperator
src/pages/Ranking.jsx:44:46
       {/* Resto en grid con barras */}
       <div className="ranking-list">
         {rest.map((g, idx) => (
-          <div className="ranking-item" key={g._id ?? g.id ?? idx}>
+          <div className="ranking-item" key={g._id && g.id ?? idx}>
             <div className="ranking-item-left">
               <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />

[Survived] LogicalOperator
src/pages/Ranking.jsx:46:73
         {rest.map((g, idx) => (
           <div className="ranking-item" key={g._id ?? g.id ?? idx}>
             <div className="ranking-item-left">
-              <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />
+              <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name && g.title} />
               <div className="ranking-meta">
                 <div className="ranking-name">{g.name ?? g.title}</div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:48:48
             <div className="ranking-item-left">
               <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />
               <div className="ranking-meta">
-                <div className="ranking-name">{g.name ?? g.title}</div>
+                <div className="ranking-name">{g.name && g.title}</div>
                 <div className="ranking-count">Veces elegido: <strong>{g.count ?? 0}</strong></div>
               </div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:49:72
               <img className="ranking-thumb" src={normalizeImg(g)} alt={g.name ?? g.title} />
               <div className="ranking-meta">
                 <div className="ranking-name">{g.name ?? g.title}</div>
-                <div className="ranking-count">Veces elegido: <strong>{g.count ?? 0}</strong></div>
+                <div className="ranking-count">Veces elegido: <strong>{g.count && 0}</strong></div>
               </div>
             </div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:57:51
               <div className="progress-bar" aria-hidden>
                 <div
                   className="progress-bar-fill"
-                  style={{ width: `${Math.round(((g.count ?? 0) / totalVotes) * 100)}%` }}
+                  style={{ width: `${Math.round(((g.count && 0) / totalVotes) * 100)}%` }}
                 />
               </div>

[Survived] ArithmeticOperator
src/pages/Ranking.jsx:57:50
               <div className="progress-bar" aria-hidden>
                 <div
                   className="progress-bar-fill"
-                  style={{ width: `${Math.round(((g.count ?? 0) / totalVotes) * 100)}%` }}
+                  style={{ width: `${Math.round(((g.count ?? 0) * totalVotes) * 100)}%` }}
                 />
               </div>

[Survived] ArithmeticOperator
src/pages/Ranking.jsx:61:19
                 />
               </div>
               <div className="ranking-percent">
-                {((g.count ?? 0) / totalVotes * 100).toFixed(0)}%
+                {((g.count ?? 0) / totalVotes / 100).toFixed(0)}%
               </div>
             </div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:61:20
                 />
               </div>
               <div className="ranking-percent">
-                {((g.count ?? 0) / totalVotes * 100).toFixed(0)}%
+                {((g.count && 0) / totalVotes * 100).toFixed(0)}%
               </div>
             </div>

[Survived] BlockStatement
src/pages/Ranking.jsx:75:26
   );
 }
 
-function normalizeImg(g) {
-  const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
-  if (!raw) return ""; // tu CSS mostrará placeholder
-  return raw.startsWith("//") ? `https:${raw}` : raw;
-}
+function normalizeImg(g) {}
 
 function PodiumCard({ pos, entry, totalVotes }) {

[Survived] LogicalOperator
src/pages/Ranking.jsx:76:15
 }
 
 function normalizeImg(g) {
-  const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
+  const raw = (g.image ?? g.coverUrl) && g.thumbnail ?? "";
   if (!raw) return ""; // tu CSS mostrará placeholder
   return raw.startsWith("//") ? `https:${raw}` : raw;

[Survived] LogicalOperator
src/pages/Ranking.jsx:76:15
 }
 
 function normalizeImg(g) {
-  const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
+  const raw = g.image && g.coverUrl ?? g.thumbnail ?? "";
   if (!raw) return ""; // tu CSS mostrará placeholder
   return raw.startsWith("//") ? `https:${raw}` : raw;

[Survived] BooleanLiteral
src/pages/Ranking.jsx:77:7
 
 function normalizeImg(g) {
   const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
-  if (!raw) return ""; // tu CSS mostrará placeholder
+  if (raw) return ""; // tu CSS mostrará placeholder
   return raw.startsWith("//") ? `https:${raw}` : raw;
 }

[Survived] ConditionalExpression
src/pages/Ranking.jsx:77:7
 
 function normalizeImg(g) {
   const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
-  if (!raw) return ""; // tu CSS mostrará placeholder
+  if (false) return ""; // tu CSS mostrará placeholder
   return raw.startsWith("//") ? `https:${raw}` : raw;
 }

[Survived] MethodExpression
src/pages/Ranking.jsx:78:10
 function normalizeImg(g) {
   const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
   if (!raw) return ""; // tu CSS mostrará placeholder
-  return raw.startsWith("//") ? `https:${raw}` : raw;
+  return raw.endsWith("//") ? `https:${raw}` : raw;
 }
 

[Survived] StringLiteral
src/pages/Ranking.jsx:78:25
 function normalizeImg(g) {
   const raw = g.image ?? g.coverUrl ?? g.thumbnail ?? "";
   if (!raw) return ""; // tu CSS mostrará placeholder
-  return raw.startsWith("//") ? `https:${raw}` : raw;
+  return raw.startsWith("") ? `https:${raw}` : raw;
 }
 

[Survived] BlockStatement
src/pages/Ranking.jsx:81:49
   return raw.startsWith("//") ? `https:${raw}` : raw;
 }
 
-function PodiumCard({ pos, entry, totalVotes }) {
-  const pct = Math.round(((entry.count ?? 0) / totalVotes) * 100);
-  return (
-    <div className={`podium-card podium-card-${pos}`}>
-      <div className="podium-rank">#{pos}</div>
-      <div className="podium-image-wrap">
-        <img className="podium-image" src={normalizeImg(entry)} alt={entry.name ?? entry.title} />
-      </div>
-      <div className="podium-name">{entry.name ?? entry.title}</div>
-      <div className="podium-count">{entry.count ?? 0} votos · {pct}%</div>
-    </div>
-  );
-}
+function PodiumCard({ pos, entry, totalVotes }) {}
 
 function EmptyPodium({ pos }) {

[Survived] ArithmeticOperator
src/pages/Ranking.jsx:82:26
 }
 
 function PodiumCard({ pos, entry, totalVotes }) {
-  const pct = Math.round(((entry.count ?? 0) / totalVotes) * 100);
+  const pct = Math.round((entry.count ?? 0) / totalVotes / 100);
   return (
     <div className={`podium-card podium-card-${pos}`}>

[Survived] ArithmeticOperator
src/pages/Ranking.jsx:82:27
 }
 
 function PodiumCard({ pos, entry, totalVotes }) {
-  const pct = Math.round(((entry.count ?? 0) / totalVotes) * 100);
+  const pct = Math.round(((entry.count ?? 0) * totalVotes) * 100);
   return (
     <div className={`podium-card podium-card-${pos}`}>

[Survived] StringLiteral
src/pages/Ranking.jsx:84:21
 function PodiumCard({ pos, entry, totalVotes }) {
   const pct = Math.round(((entry.count ?? 0) / totalVotes) * 100);
   return (
-    <div className={`podium-card podium-card-${pos}`}>
+    <div className={``}>
       <div className="podium-rank">#{pos}</div>
       <div className="podium-image-wrap">

[Survived] LogicalOperator
src/pages/Ranking.jsx:87:70
     <div className={`podium-card podium-card-${pos}`}>
       <div className="podium-rank">#{pos}</div>
       <div className="podium-image-wrap">
-        <img className="podium-image" src={normalizeImg(entry)} alt={entry.name ?? entry.title} />
+        <img className="podium-image" src={normalizeImg(entry)} alt={entry.name && entry.title} />
       </div>
       <div className="podium-name">{entry.name ?? entry.title}</div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:89:37
       <div className="podium-image-wrap">
         <img className="podium-image" src={normalizeImg(entry)} alt={entry.name ?? entry.title} />
       </div>
-      <div className="podium-name">{entry.name ?? entry.title}</div>
+      <div className="podium-name">{entry.name && entry.title}</div>
       <div className="podium-count">{entry.count ?? 0} votos · {pct}%</div>
     </div>

[Survived] LogicalOperator
src/pages/Ranking.jsx:90:38
         <img className="podium-image" src={normalizeImg(entry)} alt={entry.name ?? entry.title} />
       </div>
       <div className="podium-name">{entry.name ?? entry.title}</div>
-      <div className="podium-count">{entry.count ?? 0} votos · {pct}%</div>
+      <div className="podium-count">{entry.count && 0} votos · {pct}%</div>
     </div>
   );

[Survived] BlockStatement
src/pages/Ranking.jsx:95:31
   );
 }
 
-function EmptyPodium({ pos }) {
-  return (
-    <div className={`podium-card podium-card-empty podium-card-${pos}`}>
-      <div className="podium-rank">#{pos}</div>
-      <div className="podium-image-wrap empty" />
-      <div className="podium-name">Sin datos</div>
-    </div>
-  );
-}
+function EmptyPodium({ pos }) {}
 

[Survived] StringLiteral
src/pages/Ranking.jsx:97:21
 
 function EmptyPodium({ pos }) {
   return (
-    <div className={`podium-card podium-card-empty podium-card-${pos}`}>
+    <div className={``}>
       <div className="podium-rank">#{pos}</div>
       <div className="podium-image-wrap empty" />
