[Timeout] StringLiteral
src/pages/Register.jsx:6:38
 
 export default function Register({ onRegister, goLogin }) {
   const [username, setUsername] = useState("");
-  const [gmail, setGmail] = useState(""); // email real
+  const [gmail, setGmail] = useState("Stryker was here!"); // email real
   const [password, setPassword] = useState("");
   const [confirmar, setConfirmar] = useState("");

[Timeout] StringLiteral
src/pages/Register.jsx:10:42
   const [password, setPassword] = useState("");
   const [confirmar, setConfirmar] = useState("");
   const [error, setError] = useState("");
-  const [success, setSuccess] = useState("");
+  const [success, setSuccess] = useState("Stryker was here!");
 
   async function handleSubmit(e) {

[Timeout] StringLiteral
src/pages/Register.jsx:14:14
 
   async function handleSubmit(e) {
     e.preventDefault();
-    setError("");
+    setError("Stryker was here!");
     setSuccess("");
 

[Timeout] StringLiteral
src/pages/Register.jsx:15:16
   async function handleSubmit(e) {
     e.preventDefault();
     setError("");
-    setSuccess("");
+    setSuccess("Stryker was here!");
 
     if (password !== confirmar) {

[Killed] ConditionalExpression
src/pages/Register.jsx:17:9
     setError("");
     setSuccess("");
 
-    if (password !== confirmar) {
+    if (true) {
       return setError("Las contraseñas no coinciden");
     }
killedBy: Register.jsx - validación de formulario muestra mensaje de éxito cuando el registro es correcto
statusReason: Error: Unable to find an element with the text: Usuario registrado correctamente. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Timeout] EqualityOperator
src/pages/Register.jsx:17:9
     setError("");
     setSuccess("");
 
-    if (password !== confirmar) {
+    if (password === confirmar) {
       return setError("Las contraseñas no coinciden");
     }

[Timeout] StringLiteral
src/pages/Register.jsx:22:31
     }
 
     try {
-      const res = await fetch("http://localhost:8080/api/users", {
+      const res = await fetch("", {
         method: "POST",
         headers: { "Content-Type": "application/json" },

[Timeout] LogicalOperator
src/pages/Register.jsx:35:18
       const data = await res.json();
 
       if (!res.ok) {
-        setError(data.error || "No se pudo crear el usuario");
+        setError(data.error && "No se pudo crear el usuario");
         return;
       }

[Timeout] ConditionalExpression
src/pages/Register.jsx:35:18
       const data = await res.json();
 
       if (!res.ok) {
-        setError(data.error || "No se pudo crear el usuario");
+        setError(true);
         return;
       }

[Timeout] BlockStatement
src/pages/Register.jsx:43:24
       setSuccess("Usuario registrado correctamente");
 
       // Volver al login tras 1 segundo
-      setTimeout(() => {
-        onRegister();
-      }, 1000);
+      setTimeout(() => {}, 1000);
 
     } catch (err) {

[Timeout] BlockStatement
src/pages/Register.jsx:47:19
         onRegister();
       }, 1000);
 
-    } catch (err) {
-      console.error("Error:", err);
-      setError("No se pudo conectar con el servidor");
-    }
+    } catch (err) {}
   }
 

[Killed] ArrowFunction
src/pages/Register.jsx:69:21
         <label>Email</label>
         <input
           value={gmail}
-          onChange={(e) => setGmail(e.target.value)}
+          onChange={() => undefined}
           required
         />
killedBy: Register.jsx - validación de formulario muestra error cuando las contraseñas no coinciden
statusReason: TestingLibraryElementError: Unable to find an element with the text: Las contraseñas no coinciden. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Timeout] ArrowFunction
src/pages/Register.jsx:85:21
         <input
           type="password"
           value={confirmar}
-          onChange={(e) => setConfirmar(e.target.value)}
+          onChange={() => undefined}
           required
         />

[Killed] ConditionalExpression
src/pages/Register.jsx:89:10
           required
         />
 
-        {error && <p className="error">{error}</p>}
+        {false}
         {success && <p className="success">{success}</p>}
 
killedBy: Register.jsx - validación de formulario muestra error cuando las contraseñas no coinciden
statusReason: TestingLibraryElementError: Unable to find an element with the text: Las contraseñas no coinciden. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="auth-card"
    >

[Timeout] ConditionalExpression
src/pages/Register.jsx:89:10
           required
         />
 
-        {error && <p className="error">{error}</p>}
+        {true}
         {success && <p className="success">{success}</p>}
 

[Timeout] LogicalOperator
src/pages/Register.jsx:90:10
         />
 
         {error && <p className="error">{error}</p>}
-        {success && <p className="success">{success}</p>}
+        {success || <p className="success">{success}</p>}
 
         <button type="submit">Registrarme</button>

[Timeout] ConditionalExpression
src/pages/Register.jsx:90:10
         />
 
         {error && <p className="error">{error}</p>}
-        {success && <p className="success">{success}</p>}
+        {false}
 
         <button type="submit">Registrarme</button>
